In [5]:
import pandas as pd
import numpy as np

In [6]:
datam = [1, 2, 39, 67, 90]

In [7]:
pd.DataFrame(datam, columns = ["column_name"])

   column_name
0            1
1            2
2           39
3           67
4           90

In [8]:
m = np.arange(1,10).reshape((3,3))

In [9]:
df=pd.DataFrame(m, columns = ["var1", "var2", "var3"])

In [10]:
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [11]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [13]:
d = {'col1': [1, 2], 'col2': [3, 4]}

In [14]:
df = pd.DataFrame(data=d)

In [15]:
df

   col1  col2
0     1     3
1     2     4

In [16]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data, index=['first', 'second'])
df

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [17]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df1 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b'])
df2 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b1'])

In [18]:
df1

        a   b
first   1   2
second  5  10

In [19]:
df2

        a  b1
first   1 NaN
second  5 NaN

In [20]:
d = {'one 1' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)

In [21]:
df

   one 1  two
a    1.0    1
b    2.0    2
c    3.0    3
d    NaN    4

In [22]:
df.two

a    1
b    2
c    3
d    4
Name: two, dtype: int64

In [25]:
df["one 1"]

a    1.0
b    2.0
c    3.0
d    NaN
Name: one 1, dtype: float64

In [27]:
N=20
df = pd.DataFrame({
   'A': pd.date_range(start='2016-01-01',periods=N,freq='D'),
   'x': np.linspace(0,stop=N-1,num=N),
   'y': np.random.rand(N),
   'C': np.random.choice(['Low','Medium','High'],N).tolist(),
   'D': np.random.normal(100, 10, size=(N)).tolist()
   })

In [29]:
df.head()

           A    x         y       C           D
0 2016-01-01  0.0  0.054360     Low   93.494276
1 2016-01-02  1.0  0.785699     Low   96.016815
2 2016-01-03  2.0  0.435064  Medium   97.136193
3 2016-01-04  3.0  0.876608     Low   89.105338
4 2016-01-05  4.0  0.955278  Medium  106.820288

In [30]:
df.head(1)

           A    x        y    C          D
0 2016-01-01  0.0  0.05436  Low  93.494276

In [31]:
df.tail(1)

            A     x         y    C           D
19 2016-01-20  19.0  0.006512  Low  100.183271

In [38]:
df.rename(columns={"x":"TT"}, inplace=True)

In [40]:
df.rename(index={0:100}, inplace=True)

In [42]:
df["yeni"]=df.TT+df.y

In [44]:
data={"name":pd.Series(["ali", "ayşe", "fatma", "mehmet"]), "boy":pd.Series([1.70,1.55,1.60,1.90]), "kilo":pd.Series([70,55, 60, 80])}

In [45]:
Df=pd.DataFrame(data)

In [46]:
Df

     name   boy  kilo
0     ali  1.70    70
1    ayşe  1.55    55
2   fatma  1.60    60
3  mehmet  1.90    80

In [47]:
Df["beden kitle Endeksi"]=(Df["kilo"]/Df["boy"]**2)

In [48]:
Df

     name   boy  kilo  beden kitle Endeksi
0     ali  1.70    70            24.221453
1    ayşe  1.55    55            22.892820
2   fatma  1.60    60            23.437500
3  mehmet  1.90    80            22.160665

In [50]:
df.pop("yeni")

100     0.054360
1       1.785699
2       2.435064
3       3.876608
4       4.955278
5       5.099772
6       6.080553
7       7.790886
8       8.915242
9       9.486937
10     10.322858
11     11.127134
12     12.309394
13     13.239749
14     14.306336
15     15.812279
16     16.614527
17     17.919860
18     18.032379
19     19.006512
Name: yeni, dtype: float64

In [56]:
del df["C"]

In [61]:
df = pd.DataFrame([[1, 2, 1], [3, 4, 5]], columns = ['a',"b", "c"])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

In [63]:
df3=df.append(df2)

In [64]:
df3.T

     0    1    0    1
a  1.0  3.0  5.0  7.0
b  2.0  4.0  6.0  8.0
c  1.0  5.0  NaN  NaN

In [65]:
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'temperature': [32,35,28,24,32,31],
    'windspeed': [6,7,2,7,4,2],
    'event': ['Rain', 'Sunny', 'Snow','Snow','Rain', 'Sunny']
}
df = pd.DataFrame(weather_data)

In [66]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          6 non-null      object
 1   temperature  6 non-null      int64
 2   windspeed    6 non-null      int64
 3   event        6 non-null      object
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [68]:

df5 = pd.DataFrame({
    'column_1': np.random.choice(['yazı', 'Tura' ], 10 ** 6),
    
})

In [71]:
df5.column_1.value_counts(dropna=False)

yazı    500110
Tura    499890
Name: column_1, dtype: int64

In [72]:
df5.describe()

       column_1
count   1000000
unique        2
top        yazı
freq     500110

In [73]:
df = pd.DataFrame({'num_legs': [2, 4], 'num_wings': [2, 0]},
                  index=['falcon', 'dog'])

In [74]:
df

        num_legs  num_wings
falcon         2          2
dog            4          0

In [75]:
df.isin([0,4])

        num_legs  num_wings
falcon     False      False
dog         True       True

In [86]:
df = pd.DataFrame(np.arange(10).reshape(-1, 2), columns=['A', 'B'])
df2 = pd.DataFrame(np.arange(10).reshape(-1, 2), columns=['A', 'B'])

In [87]:
kural=df%2==0

In [88]:
df

   A  B
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [89]:
df.where(kural)

   A   B
0  0 NaN
1  2 NaN
2  4 NaN
3  6 NaN
4  8 NaN

In [90]:
df

   A  B
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [91]:
df.count()

A    5
B    5
dtype: int64

In [93]:
df=pd.DataFrame(np.random.randn(5,4), index="A B C D E".split(), columns= "W X Y Z".split())

In [96]:
df

          W         X         Y         Z
A  1.092043  0.918996  0.535187 -0.367331
B -0.092171  0.106846  1.773297 -1.038800
C  0.445305 -0.313938 -2.340538  2.461764
D -0.733308 -1.629808 -0.646898  2.177909
E  1.005638 -0.224909  1.102110  0.957193

In [97]:
df[["W","Y"]]

          W         Y
A  1.092043  0.535187
B -0.092171  1.773297
C  0.445305 -2.340538
D -0.733308 -0.646898
E  1.005638  1.102110

In [103]:
df.drop(["Z"], axis=1)

          W         X         Y
A  1.092043  0.918996  0.535187
B -0.092171  0.106846  1.773297
C  0.445305 -0.313938 -2.340538
D -0.733308 -1.629808 -0.646898
E  1.005638 -0.224909  1.102110

In [108]:
df.drop(["A", "B"], axis=0,inplace=True)

In [109]:
df

          W         X         Y         Z
C  0.445305 -0.313938 -2.340538  2.461764
D -0.733308 -1.629808 -0.646898  2.177909

In [110]:

df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])

In [111]:
df

          A         B         C         D
a -0.322076 -0.267307 -0.311505 -0.181320
b -0.971551 -0.052066  0.349351  0.804929
c -0.252682  0.039965  0.232289  0.066683
d -0.250878  0.122763 -0.198582  0.034600
e -0.248130  0.414484  1.119560  0.790536
f -0.433616 -2.615057 -0.695501  0.998254
g  2.373914  0.828151  0.881266  0.547559
h  0.639171 -0.536422 -0.956496 -0.055410

In [112]:
df.loc[:,"C"]

a   -0.311505
b    0.349351
c    0.232289
d   -0.198582
e    1.119560
f   -0.695501
g    0.881266
h   -0.956496
Name: C, dtype: float64

In [115]:
selection=df.loc[["a", "d", "f"],["B","C"]]>0

In [117]:
df.loc[["a", "d", "f"],["B","C"]][selection]

          B   C
a       NaN NaN
d  0.122763 NaN
f       NaN NaN

In [118]:
df.loc[["a", "d", "f"],["B","C"]]

          B         C
a -0.267307 -0.311505
d  0.122763 -0.198582
f -2.615057 -0.695501

In [119]:
df

          A         B         C         D
a -0.322076 -0.267307 -0.311505 -0.181320
b -0.971551 -0.052066  0.349351  0.804929
c -0.252682  0.039965  0.232289  0.066683
d -0.250878  0.122763 -0.198582  0.034600
e -0.248130  0.414484  1.119560  0.790536
f -0.433616 -2.615057 -0.695501  0.998254
g  2.373914  0.828151  0.881266  0.547559
h  0.639171 -0.536422 -0.956496 -0.055410

In [120]:
df.loc["a":"d", "B":"C"]

          B         C
a -0.267307 -0.311505
b -0.052066  0.349351
c  0.039965  0.232289
d  0.122763 -0.198582

In [121]:
df.loc["a":"d", "B":"C"]>0.2

       B      C
a  False  False
b  False   True
c  False   True
d  False  False

In [122]:
df.loc["a":"d", "B":"C"][df.loc["a":"d", "B":"C"]>0.2]

    B         C
a NaN       NaN
b NaN  0.349351
c NaN  0.232289
d NaN       NaN

In [125]:
df[df<0]

          A         B         C        D
a -0.322076 -0.267307 -0.311505 -0.18132
b -0.971551 -0.052066       NaN      NaN
c -0.252682       NaN       NaN      NaN
d -0.250878       NaN -0.198582      NaN
e -0.248130       NaN       NaN      NaN
f -0.433616 -2.615057 -0.695501      NaN
g       NaN       NaN       NaN      NaN
h       NaN -0.536422 -0.956496 -0.05541

In [126]:
df = pd.DataFrame(np.random.randn(8, 4), columns = ['A', 'B', 'C', 'D'])

In [127]:
df

          A         B         C         D
0  0.443215 -1.378529 -0.361267 -1.616478
1  0.479155  0.772001 -1.278295  0.332978
2  1.552181  1.485286  1.049030 -1.024796
3  1.082730  0.547211  0.555904  0.375887
4 -0.517970 -2.347738  1.339051  0.642403
5  0.737671 -0.087426 -0.875097  0.087781
6 -0.176148  1.266935 -1.383522 -0.111215
7  0.852420 -0.585298 -0.612375 -0.804414

In [129]:
df.iloc[:2,1:]

          B         C         D
0 -1.378529 -0.361267 -1.616478
1  0.772001 -1.278295  0.332978

In [132]:
df.iloc[[1,5], [1,2]]

          B         C
1  0.772001 -1.278295
5 -0.087426 -0.875097

In [ ]:
2 ve 3 nolu satırları ile B ve C sütunlarınn pozitif sayılarını getiriniz

In [138]:
df.iloc[[4,5],[0,1]][df.iloc[[4,5],[0,1]]>0]

          A   B
4       NaN NaN
5  0.737671 NaN

In [139]:
df

          A         B         C         D
0  0.443215 -1.378529 -0.361267 -1.616478
1  0.479155  0.772001 -1.278295  0.332978
2  1.552181  1.485286  1.049030 -1.024796
3  1.082730  0.547211  0.555904  0.375887
4 -0.517970 -2.347738  1.339051  0.642403
5  0.737671 -0.087426 -0.875097  0.087781
6 -0.176148  1.266935 -1.383522 -0.111215
7  0.852420 -0.585298 -0.612375 -0.804414

In [ ]:
B sütunu 0'dan büyük olan C sütunu değerleri getiriniz.

In [143]:
df[df.iloc[:,1]>0].C

1   -1.278295
2    1.049030
3    0.555904
6   -1.383522
Name: C, dtype: float64

In [ ]:
ÖDEV

In [ ]:
B sütun 1 ile 2 arasında olan satır değerelerinin C sütunu karşılıklarını getiriniz.

In [144]:
df = pd.DataFrame({'num_legs': [2, 4], 'num_wings': [2, 0]},
                  index=['falcon', 'dog'])

In [145]:
df

        num_legs  num_wings
falcon         2          2
dog            4          0

In [148]:
df.loc[["falcon"]].isin([2,3])

        num_legs  num_wings
falcon      True       True

In [149]:
df=pd.DataFrame(np.random.randn(10,2),index=[1,4,6,2,3,5,9,8,0,7],columns=['col2','col1'])

In [150]:
df

       col2      col1
1  2.484638  0.290334
4 -1.005406 -1.112715
6 -1.275638  0.878719
2 -0.640752  2.031731
3 -0.807234 -0.338299
5  0.405366  1.094569
9 -0.852388  0.220472
8 -0.630681 -1.628078
0  0.403984 -1.353986
7 -0.983579 -0.294532

In [152]:
df.sort_index(ascending=False)

       col2      col1
9 -0.852388  0.220472
8 -0.630681 -1.628078
7 -0.983579 -0.294532
6 -1.275638  0.878719
5  0.405366  1.094569
4 -1.005406 -1.112715
3 -0.807234 -0.338299
2 -0.640752  2.031731
1  2.484638  0.290334
0  0.403984 -1.353986

In [153]:
df.sort_index(axis=1)

       col1      col2
1  0.290334  2.484638
4 -1.112715 -1.005406
6  0.878719 -1.275638
2  2.031731 -0.640752
3 -0.338299 -0.807234
5  1.094569  0.405366
9  0.220472 -0.852388
8 -1.628078 -0.630681
0 -1.353986  0.403984
7 -0.294532 -0.983579

In [155]:
df.sort_values(by="col2")

       col2      col1
6 -1.275638  0.878719
4 -1.005406 -1.112715
7 -0.983579 -0.294532
9 -0.852388  0.220472
3 -0.807234 -0.338299
2 -0.640752  2.031731
8 -0.630681 -1.628078
0  0.403984 -1.353986
5  0.405366  1.094569
1  2.484638  0.290334

In [156]:
df

       col2      col1
1  2.484638  0.290334
4 -1.005406 -1.112715
6 -1.275638  0.878719
2 -0.640752  2.031731
3 -0.807234 -0.338299
5  0.405366  1.094569
9 -0.852388  0.220472
8 -0.630681 -1.628078
0  0.403984 -1.353986
7 -0.983579 -0.294532

In [157]:
df2 = pd.DataFrame({'col1':[2,1,1,1],'col2':[1,3,2,4]})

In [158]:
df2

   col1  col2
0     2     1
1     1     3
2     1     2
3     1     4

In [160]:
df2.sort_values(by=["col1", "col2"],ascending=False)

   col1  col2
0     2     1
3     1     4
1     1     3
2     1     2

In [176]:
df = pd.DataFrame(data=[['Tom', '  William Rick  '], ['John  ', np.nan],['  Alber@t', np.nan], ['  1234','SteveSmith']], columns=["col1","col2"])

In [177]:
df

        col1              col2
0        Tom    William Rick
1     John                 NaN
2    Alber@t               NaN
3       1234        SteveSmith

In [178]:
type(df.col1)

pandas.core.series.Series

In [179]:
df["upper"]=df.col1.str.upper()

In [180]:
df

        col1              col2      upper
0        Tom    William Rick          TOM
1     John                 NaN     JOHN
2    Alber@t               NaN    ALBER@T
3       1234        SteveSmith       1234

In [181]:
df["lower"]=df.col2.str.lower()

In [170]:
df["len"]=df.col1.str.len()

In [182]:
df

        col1              col2      upper             lower
0        Tom    William Rick          TOM    william rick
1     John                 NaN     JOHN                 NaN
2    Alber@t               NaN    ALBER@T               NaN
3       1234        SteveSmith       1234        stevesmith

In [183]:
df["boşluk sayısı"]=df.col1.str.count(" ")

In [184]:
df

        col1              col2      upper             lower  boşluk sayısı
0        Tom    William Rick          TOM    william rick                0
1     John                 NaN     JOHN                 NaN              2
2    Alber@t               NaN    ALBER@T               NaN              2
3       1234        SteveSmith       1234        stevesmith              2

In [185]:
df.col1=df.col1.str.strip()

In [186]:
df["len2"]=df.col1.str.len()

In [187]:
df

      col1              col2      upper             lower  boşluk sayısı  len2
0      Tom    William Rick          TOM    william rick                0     3
1     John               NaN     JOHN                 NaN              2     4
2  Alber@t               NaN    ALBER@T               NaN              2     7
3     1234        SteveSmith       1234        stevesmith              2     4

In [188]:
df

      col1              col2      upper             lower  boşluk sayısı  len2
0      Tom    William Rick          TOM    william rick                0     3
1     John               NaN     JOHN                 NaN              2     4
2  Alber@t               NaN    ALBER@T               NaN              2     7
3     1234        SteveSmith       1234        stevesmith              2     4

In [189]:
df["mySplit"]=df.upper.str.split()

In [190]:
df

,col1,col2,upper,lower,boşluk sayısı,len2,mySplit
0,Tom,William Rick,TOM,william rick,0,3,[TOM]
1,John,NaN,JOHN,NaN,2,4,[JOHN]
2,Alber@t,NaN,ALBER@T,NaN,2,7,[ALBER@T]
3,1234,SteveSmith,1234,stevesmith,2,4,[1234]

In [191]:
df["mySplit2"]=df.col2.str.split("i")

In [192]:
df

,col1,col2,upper,lower,boşluk sayısı,len2,mySplit,mySplit2
0,Tom,William Rick,TOM,william rick,0,3,[TOM],"[ W, ll, am R, ck ]"
1,John,NaN,JOHN,NaN,2,4,[JOHN],NaN
2,Alber@t,NaN,ALBER@T,NaN,2,7,[ALBER@T],NaN
3,1234,SteveSmith,1234,stevesmith,2,4,[1234],"[SteveSm, th]"

In [195]:
df.mySplit2[0][2]

'R'

In [ ]:
get dummies

In [196]:
s = pd.Series(['a1', 'b2', 'c3', "c3"])

In [197]:
s

0    a1
1    b2
2    c3
3    c3
dtype: object

In [198]:
pd.get_dummies(s)

   a1  b2  c3
0   1   0   0
1   0   1   0
2   0   0   1
3   0   0   1

In [199]:
df2 = pd.DataFrame({'A': ['a', 'b', 'a'], 'B': ['b', 'a', 'c'],
                   'C': [1, 2, 3]})

In [200]:
df2

   A  B  C
0  a  b  1
1  b  a  2
2  a  c  3

In [202]:
pd.get_dummies(df2, prefix="xxx")

   C  xxx_a  xxx_b  xxx_a  xxx_b  xxx_c
0  1      1      0      0      1      0
1  2      0      1      1      0      0
2  3      1      0      0      0      1

In [203]:
pd.get_dummies(df2, prefix=["sütun_1", "sütun_2"])

   C  sütun_1_a  sütun_1_b  sütun_2_a  sütun_2_b  sütun_2_c
0  1          1          0          0          1          0
1  2          0          1          1          0          0
2  3          1          0          0          0          1

In [206]:
df = pd.DataFrame(data=[['Tom', '  William Rick  '], ['John  ', np.nan],['  Alber@t', np.nan], ['  1234','SteveSmith']], columns=["col1","col2"])

In [207]:
df

        col1              col2
0        Tom    William Rick
1     John                 NaN
2    Alber@t               NaN
3       1234        SteveSmith

In [208]:
df.col1.str.contains("@")

0    False
1    False
2     True
3    False
Name: col1, dtype: bool

In [209]:
df[df.col1.str.contains("@")]

        col1 col2
2    Alber@t  NaN

In [211]:
df.col1=df.col1.str.replace("@", "")

In [212]:
df

       col1              col2
0       Tom    William Rick
1    John                 NaN
2    Albert               NaN
3      1234        SteveSmith

In [217]:
filtre=df.col1.str.startswith("T")

In [220]:
df[filtre]

  col1              col2
0  Tom    William Rick

In [216]:
df[~df.col1.str.startswith("T")]

       col1        col2
1    John           NaN
2    Albert         NaN
3      1234  SteveSmith

In [230]:
df=pd.read_csv("temp.csv")

In [231]:
df

   S.No    Name  Age       City  Salary
0     1     Tom   28    Toronto   20000
1     2     Lee   32   HongKong    3000
2     3  Steven   43   Bay Area    8300
3     4     Ram   38  Hyderabad    3900

In [241]:
for i in range(len(df.Age.values)):
    df.Age.values[i]+=100

In [242]:
df

   S.No    Name  Age       City  Salary
0     1     Tom  128    Toronto   20000
1     2     Lee  132   HongKong    3000
2     3  Steven  143   Bay Area    8300
3     4     Ram  138  Hyderabad    3900

In [244]:
pd.get_dummies(df)

,S.No,Age,Salary,Name_Lee,Name_Ram,Name_Steven,Name_Tom,City_Bay Area,City_HongKong,City_Hyderabad,City_Toronto
0,1,128,20000,0,0,0,1,0,0,0,1
1,2,132,3000,1,0,0,0,0,1,0,0
2,3,143,8300,0,0,1,0,1,0,0,0
3,4,138,3900,0,1,0,0,0,0,1,0

In [245]:
df.to_csv("temizCsv.csv")

In [247]:
titanic=pd.read_csv("titanic.csv")

In [248]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [249]:
titanic.sex.value_counts(dropna=False)

male      577
female    314
Name: sex, dtype: int64

In [251]:
titanic.deck.value_counts(dropna=False)

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [252]:
titanic.deck.isnull().sum()

688

In [253]:
titanic.dtypes

survived         int64
pclass           int64
sex             object
age            float64
sibsp            int64
parch            int64
fare           float64
embarked        object
class           object
who             object
adult_male        bool
deck            object
embark_town     object
alive           object
alone             bool
dtype: object

In [254]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
                           'two'],
                   'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'baz': [1, 2, 3, 4, 5, 6],
                   'zoo': ['x', 'y', 'z', 'q', 'w', 't']})

In [255]:
df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [256]:
df.to_csv("mysample.csv")

In [257]:
df = pd.read_excel("Excel_Sample.xlsx")

In [258]:
df

   1        a        b        c
0  2  sheet-1  sheet-1  sheet-1
1  3  sheet-1  sheet-1  sheet-1
2  4  sheet-1  sheet-1  sheet-1
3  5  sheet-1  sheet-1  sheet-1

In [263]:
df2 = pd.read_excel("Excel_Sample.xlsx", sheet_name="Sheet2")

In [264]:
df2

   1      a      b      c
0  2  shee2  shee2  shee2
1  3  shee2  shee2  shee2
2  4  shee2  shee2  shee2
3  5  shee2  shee2  shee2

In [265]:
df3=pd.read_html("https://en.wikipedia.org/wiki/Pythonidae")

In [267]:
df3=pd.DataFrame(df3)

In [269]:
df3.iloc[:1,:1].values[0][0].values[0][1]

"This article's lead section may be too short to adequately summarize the key points. Please consider expanding the lead to provide an accessible overview of all important aspects of the article. (May 2020)"

In [271]:
df = pd.read_csv('nyc_weather.csv', parse_dates=['EST'])
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,2016-01-01,38,23,52,30.03,10,8.0,0,5,NaN,281
1,2016-01-02,36,18,46,30.02,10,7.0,0,3,NaN,275
2,2016-01-03,40,21,47,29.86,10,8.0,0,1,NaN,277
3,2016-01-04,25,9,44,30.05,10,9.0,0,3,NaN,345
4,2016-01-05,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [277]:
df.Events.value_counts(dropna=False)

NaN         22
Rain         4
Snow         3
Fog-Snow     2
Name: Events, dtype: int64

In [278]:
df["EST"][df["Events"]=="Rain"]

8    2016-01-09
9    2016-01-10
15   2016-01-16
26   2016-01-27
Name: EST, dtype: datetime64[ns]

In [280]:
df.isnull().sum()

EST                      0
Temperature              0
DewPoint                 0
Humidity                 0
Sea Level PressureIn     0
VisibilityMiles          0
WindSpeedMPH             3
PrecipitationIn          0
CloudCover               0
Events                  22
WindDirDegrees           0
df.Temperature           0
dtype: int64